Revit 2026 API

# FamilySizeTableManager Class

---

Manages importing, exporting, and querying size data through the FamilySizeTable class.

SystemObject Autodesk.Revit.DBFamilySizeTableManager

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySizeTableManager : IDisposable
```
```vb
Public Class FamilySizeTableManager
	Implements IDisposable
```
```cpp
public ref class FamilySizeTableManager : IDisposable
```
```fsharp
type FamilySizeTableManager =
    class
        interface IDisposable
    end
```

The FamilySizeTableManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfSizeTables | The number of FamilySizeTables in a family. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateFamilySizeTableManager | Adds FamilySizeTableManager to a Family. A FamilySizeTableManager and FamilySizeTables are only needed when importing, exporting, or removing size data previously stored in CSV files. |
|  | Dispose | Releases all resources used by the FamilySizeTableManager |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | ExportSizeTable | Exports the size table to aCSV file. |
|  | GetAllSizeTableNames | Get the FamilySizeTable names in a family. |
|  | GetFamilySizeTableManager | Gets a FamilySizeTableManager from a Family |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSizeTable | Get a FamilySizeTable by name. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasSizeTable | Checks if a FamilySizeTable of a given name exists. |
|  | ImportSizeTable | Imports a FamilySizeTable from a CSV file. |
|  | RemoveSizeTable | Removes the FamilySizeTable of a given name. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace